# Navegaci\u00f3n
nav.home=Inicio
nav.about=Acerca de
nav.blog=Blog
nav.components=Componentes
nav.dashboard=Panel
nav.pricing=Precios
nav.gallery=Galer\u00eda
nav.contact=Contacto
nav.search=Buscar
nav.login=Iniciar sesi\u00f3n
nav.brand=JUX Demo
nav.toggle=Alternar navegaci\u00f3n
nav.language=Idioma

# Secci\u00f3n Hero
hero.title=Crea Sitios Web en Java Puro
hero.subtitle=JUX es un framework para construir sitios web completos - p\u00e1ginas de inicio, paneles, sitios CMS - escribiendo solo Java. Sin plantillas HTML, sin archivos JS, sin CSS.
hero.cta.primary=Ver Componentes
hero.cta.secondary=Saber M\u00e1s

# Secci\u00f3n de Caracter\u00edsticas
features.title=\u00bfPor qu\u00e9 JUX?
features.subtitle=Todo lo que necesitas, todo en Java
features.java.title=Java Puro
features.java.desc=Escribe toda tu interfaz con clases Java. Componentes, p\u00e1ginas, layouts, metadatos - todo con tipos seguros, todo en tu IDE.
features.ada.title=Accesible (ADA)
features.ada.desc=WCAG 2.2 Nivel AA integrado. El framework impone accesibilidad - las im\u00e1genes requieren texto alt, los formularios necesitan etiquetas, la navegaci\u00f3n por teclado funciona.
features.ssr.title=SSR + Hidrataci\u00f3n
features.ssr.desc=Las p\u00e1ginas se renderizan en el servidor en menos de 5ms. Los componentes interactivos se hidratan en el cliente via TeaVM - sin Node.js.
features.spring.title=Spring Boot
features.spring.desc=Auto-configuraci\u00f3n, inyecci\u00f3n de dependencias, seguridad, JPA - todo el ecosistema Spring. Solo agrega jux-server como dependencia.
features.i18n.title=i18n Integrado
features.i18n.desc=Traducciones con tipos seguros via interfaces Java. Enrutamiento por idioma, pluralizaci\u00f3n, soporte RTL, formato de fechas/n\u00fameros.
features.themes.title=Personalizable
features.themes.desc=Tokens de dise\u00f1o, propiedades CSS personalizadas y componentes accesibles pre-construidos. Usa cualquier framework CSS - como Bootstrap 5 en este demo.

# Secci\u00f3n de Ejemplo de C\u00f3digo
code.title=Se Ve As\u00ed
code.subtitle=Una p\u00e1gina JUX es una clase Java. An\u00f3tala con @Route, sobreescribe render() y retorna un \u00e1rbol de elementos. Spring la descubre autom\u00e1ticamente. Sin XML, sin YAML, sin plantillas.
code.check1=Constructores de elementos con tipos seguros
code.check2=API fluida con encadenamiento
code.check3=Validaci\u00f3n en tiempo de compilaci\u00f3n
code.check4=Autocompletado completo del IDE

# Secci\u00f3n CTA
cta.title=\u00bfListo para Probarlo?
cta.subtitle=Agrega jux-server como dependencia y comienza a construir.
cta.primary=Comenzar
cta.secondary=Leer el Blog

# Pie de P\u00e1gina
footer.framework=JUX Framework
footer.description=Crea sitios web completos en Java puro. Sin plantillas HTML, sin archivos JS, sin CSS.
footer.links=Enlaces
footer.built_with=Hecho Con
footer.copyright=2026 JUX Framework Demo. Construido completamente en Java.

# \u2500\u2500 P\u00e1gina Acerca de \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
about.header.title=Acerca de JUX
about.header.subtitle=Un framework que te permite construir sitios web como construyes backends - en Java.
about.story.title=La Idea
about.story.p1=Los desarrolladores Java pasan sus d\u00edas escribiendo c\u00f3digo backend limpio y con tipos seguros con Spring Boot - luego cambian de contexto a un ecosistema completamente diferente para el frontend. JSP, Thymeleaf, o una SPA completa en JavaScript con Node.js, webpack y npm. JUX elimina esa divisi\u00f3n.
about.story.p2=Con JUX, escribes todo tu sitio web en Java. Las p\u00e1ginas son componentes. Los componentes retornan \u00e1rboles de elementos. El framework los renderiza en el servidor e hidrata las partes interactivas en el cliente via TeaVM. Spring Boot maneja el enrutamiento, DI, seguridad y persistencia. Te quedas en un solo lenguaje, un solo IDE, una sola herramienta de construcci\u00f3n.
about.story.p3=Y cada p\u00e1gina es accesible WCAG 2.2 AA por defecto. El framework lo impone a nivel de API - no hay img() sin texto alt, no hay input() sin etiqueta, la navegaci\u00f3n por teclado simplemente funciona.
about.arch.title=Arquitectura
about.arch.annotations=Definiciones de anotaciones puras. Sin dependencias.
about.arch.core=Component, Element, PageMeta, f\u00e1bricas de Elements.
about.arch.a11y=Motor de auditor\u00eda WCAG 2.2 AA con 14 reglas integradas.
about.arch.i18n=Multi-idioma: bundles, enrutamiento por locale, formato.
about.arch.server=Auto-config Spring Boot, renderizador SSR, motor de rutas.
about.arch.themes=Componentes UI accesibles: Modal, Tabs, Accordion...
about.arch.client=Hidrataci\u00f3n TeaVM, puente DOM, gesti\u00f3n de estado.
about.arch.processor=Validaci\u00f3n en tiempo de compilaci\u00f3n de rutas y bundles.
about.arch.cms=Registro de widgets, p\u00e1ginas din\u00e1micas, constructor de p\u00e1ginas.
about.faq.title=Preguntas Frecuentes
about.faq.q1=\u00bfNecesito saber HTML/CSS?
about.faq.a1=No para usar JUX. Escribes Java - el framework produce HTML5 sem\u00e1ntico. Para estilos, eliges cualquier framework CSS (como Bootstrap en este demo) y referencias clases via .cls(). Pero entender los fundamentos de HTML y CSS siempre es \u00fatil.
about.faq.q2=\u00bfC\u00f3mo funciona la interactividad del lado del cliente?
about.faq.a2=Los componentes marcados con @JuxComponent(clientSide = true) se compilan a JavaScript via TeaVM. Hidratan el HTML renderizado en el servidor y manejan eventos, cambios de estado y actualizaciones del DOM. Escribes Java - TeaVM lo compila a JS.
about.faq.q3=\u00bfPuedo usarlo con aplicaciones Spring Boot existentes?
about.faq.a3=S\u00ed. JUX funciona junto a controladores Spring MVC. Las rutas JUX tienen menor prioridad por defecto, as\u00ed que tus mappings @Controller y @RestController existentes tienen precedencia. Puedes migrar p\u00e1gina por p\u00e1gina.
about.faq.q4=\u00bfQu\u00e9 hay del rendimiento?
about.faq.a4=El SSR renderiza en menos de 5ms (en caliente). El bundle JS del cliente pesa menos de 50KB comprimido. Hay una cach\u00e9 HTML respaldada por Caffeine para p\u00e1ginas est\u00e1ticas. Cero reflexi\u00f3n en tiempo de ejecuci\u00f3n en la ruta cr\u00edtica.

# \u2500\u2500 P\u00e1gina de Contacto \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
contact.header.title=Cont\u00e1ctanos
contact.header.subtitle=Este formulario demuestra la construcci\u00f3n accesible de formularios de JUX con Bootstrap 5
contact.form.legend=Enviar un Mensaje
contact.form.name=Nombre Completo
contact.form.email=Correo Electr\u00f3nico
contact.form.subject=Asunto
contact.form.subject.choose=Elige un tema...
contact.form.subject.general=Consulta General
contact.form.subject.bug=Reporte de Error
contact.form.subject.feature=Solicitud de Funcionalidad
contact.form.subject.other=Otro
contact.form.message=Mensaje
contact.form.message.placeholder=Cu\u00e9ntanos qu\u00e9 tienes en mente...
contact.form.message.help=Por favor, s\u00e9 lo m\u00e1s detallado posible.
contact.form.newsletter=Suscribirse al bolet\u00edn de JUX
contact.form.submit=Enviar Mensaje
contact.success.title=\u00a1Mensaje Enviado!
contact.success.text=Gracias por contactarnos. Esto es un demo, as\u00ed que nada fue enviado realmente.
contact.success.btn=Volver al Inicio
contact.notes.title=Notas del Demo
contact.notes.intro=Este formulario est\u00e1 construido completamente en Java usando la API de Element de JUX. Observa las caracter\u00edsticas de accesibilidad:
contact.notes.label=Cada input tiene un <label>
contact.notes.aria=Los campos obligatorios tienen aria-required
contact.notes.fieldset=Agrupados en un <fieldset> con <legend>
contact.notes.autocomplete=Atributos autocomplete para UX
contact.notes.help=Texto de ayuda vinculado a los campos
contact.notes.submit=Env\u00eda el formulario para ver el manejo POST en acci\u00f3n.

# \u2500\u2500 P\u00e1gina de Login \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
login.title=Iniciar Sesi\u00f3n
login.email=Correo Electr\u00f3nico
login.email.placeholder=tu@ejemplo.com
login.password=Contrase\u00f1a
login.password.placeholder=Ingresa tu contrase\u00f1a
login.remember=Recordarme
login.forgot=\u00bfOlvidaste tu contrase\u00f1a?
login.submit=Ingresar
login.or=o
login.no_account=\u00bfNo tienes una cuenta?
login.signup=Reg\u00edstrate

# \u2500\u2500 P\u00e1gina 404 \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
notfound.code=404
notfound.title=P\u00e1gina No Encontrada
notfound.text=La p\u00e1gina que buscas no existe o ha sido movida.
notfound.home=Ir al Inicio
notfound.blog=Leer el Blog

# \u2500\u2500 P\u00e1gina del Panel \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
dashboard.header.title=Panel de Control
dashboard.header.subtitle=Un panel de an\u00e1lisis de ejemplo construido con la API de Element de JUX y Bootstrap 5
dashboard.stats.users=Usuarios Totales
dashboard.stats.revenue=Ingresos
dashboard.stats.orders=Pedidos
dashboard.stats.conversion=Conversi\u00f3n
dashboard.orders.title=Pedidos Recientes
dashboard.orders.caption=Pedidos recientes de clientes
dashboard.orders.col.order=Pedido #
dashboard.orders.col.customer=Cliente
dashboard.orders.col.product=Producto
dashboard.orders.col.amount=Monto
dashboard.orders.col.status=Estado
dashboard.status.completed=Completado
dashboard.status.processing=Procesando
dashboard.status.pending=Pendiente
dashboard.status.cancelled=Cancelado
dashboard.projects.title=Estado de Proyectos
dashboard.activity.title=Actividad Reciente
dashboard.activity.user.title=Nuevo usuario registrado
dashboard.activity.user.desc=Sarah Johnson cre\u00f3 una cuenta
dashboard.activity.user.time=hace 2 minutos
dashboard.activity.order.title=Pedido completado
dashboard.activity.order.desc=El pedido #3210 ha sido procesado y enviado
dashboard.activity.order.time=hace 15 minutos
dashboard.activity.update.title=Actualizaci\u00f3n del sistema desplegada
dashboard.activity.update.desc=Versi\u00f3n 2.4.1 desplegada en todos los servidores
dashboard.activity.update.time=hace 1 hora
dashboard.activity.storage.title=Advertencia de almacenamiento
dashboard.activity.storage.desc=El uso de almacenamiento de la base de datos alcanz\u00f3 el 85% de capacidad
dashboard.activity.storage.time=hace 3 horas
dashboard.activity.security.title=Escaneo de seguridad exitoso
dashboard.activity.security.desc=El escaneo semanal de vulnerabilidades se complet\u00f3 sin problemas
dashboard.activity.security.time=hace 5 horas

# \u2500\u2500 P\u00e1gina de Precios \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
pricing.header.title=Precios Simples y Transparentes
pricing.header.subtitle=Elige el plan que se adapte a tu proyecto. Sin cargos ocultos, sin sorpresas.
pricing.per_month=/mes
pricing.starter.name=Inicial
pricing.starter.price=$9
pricing.starter.desc=Perfecto para proyectos secundarios
pricing.starter.cta=Comenzar
pricing.pro.name=Profesional
pricing.pro.badge=M\u00e1s Popular
pricing.pro.price=$29
pricing.pro.desc=Para equipos y negocios en crecimiento
pricing.pro.cta=Comenzar
pricing.enterprise.name=Empresa
pricing.enterprise.price=$99
pricing.enterprise.desc=Para aplicaciones a gran escala
pricing.enterprise.cta=Contactar Ventas
pricing.feature.projects3=Hasta 3 proyectos
pricing.feature.projects_unlimited=Proyectos ilimitados
pricing.feature.storage5=5 GB de almacenamiento
pricing.feature.storage50=50 GB de almacenamiento
pricing.feature.storage500=500 GB de almacenamiento
pricing.feature.support_community=Soporte comunitario
pricing.feature.support_email=Soporte prioritario por email
pricing.feature.support_phone=Soporte telef\u00f3nico 24/7
pricing.feature.analytics_basic=An\u00e1lisis b\u00e1sico
pricing.feature.analytics_advanced=An\u00e1lisis avanzado
pricing.feature.analytics_enterprise=An\u00e1lisis empresarial
pricing.feature.ssl=Certificados SSL
pricing.feature.domains=Dominios personalizados
pricing.feature.team=Colaboraci\u00f3n en equipo
pricing.feature.api=Acceso a la API
pricing.feature.sla=Garant\u00eda SLA
pricing.feature.manager=Gestor de cuenta dedicado
pricing.faq.title=Preguntas Frecuentes
pricing.faq.q1=\u00bfPuedo cambiar de plan despu\u00e9s?
pricing.faq.a1=Por supuesto. Puedes mejorar o reducir tu plan en cualquier momento. Al mejorar, se te cobrar\u00e1 proporcionalmente por el resto de tu ciclo de facturaci\u00f3n. Al reducir, la nueva tarifa se aplica en tu pr\u00f3xima fecha de facturaci\u00f3n.
pricing.faq.q2=\u00bfQu\u00e9 m\u00e9todos de pago aceptan?
pricing.faq.a2=Aceptamos todas las tarjetas de cr\u00e9dito principales (Visa, Mastercard, American Express) as\u00ed como PayPal. Los clientes empresariales tambi\u00e9n pueden pagar por factura con t\u00e9rminos NET-30.
pricing.faq.q3=\u00bfHay una prueba gratuita?
pricing.faq.a3=\u00a1S\u00ed! Cada plan incluye una prueba gratuita de 14 d\u00edas. No se requiere tarjeta de cr\u00e9dito para comenzar. Tendr\u00e1s acceso completo a todas las funciones de tu nivel elegido durante el periodo de prueba.
pricing.faq.q4=\u00bfOfrecen reembolsos?
pricing.faq.a4=Ofrecemos una garant\u00eda de devoluci\u00f3n de dinero de 30 d\u00edas en todos los planes. Si no est\u00e1s satisfecho dentro de los primeros 30 d\u00edas, contacta a nuestro equipo de soporte para un reembolso completo - sin preguntas.

# \u2500\u2500 P\u00e1gina de B\u00fasqueda \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
search.header.title=Buscar
search.header.subtitle=Encuentra m\u00f3dulos, caracter\u00edsticas y publicaciones del blog en el framework JUX
search.placeholder=Buscar m\u00f3dulos, caracter\u00edsticas, publicaciones...
search.empty.title=Ingresa un t\u00e9rmino de b\u00fasqueda
search.empty.text=Intenta buscar "accessibility", "SSR", "i18n" o "components"
search.no_results.title=Sin resultados
search.no_results.pre=No hay coincidencias para
search.no_results.post=. Intenta con un t\u00e9rmino diferente.
search.results.found=Se encontraron
search.results.single= resultado para
search.results.multiple= resultados para

# \u2500\u2500 P\u00e1gina del Blog \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
blog.header.title=Blog
blog.header.subtitle=Tutoriales, an\u00e1lisis de arquitectura y actualizaciones del framework
blog.post.by= por
blog.post.min_read= min de lectura
blog.post.back=Volver al Blog
blog.post.notfound.code=404
blog.post.notfound.text=Esta publicaci\u00f3n del blog no existe.
blog.post.notfound.btn=Ver Todas las Publicaciones

# \u2500\u2500 P\u00e1gina de Galer\u00eda \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
gallery.header.title=Galer\u00eda de Im\u00e1genes
gallery.header.subtitle=Demostrando im\u00e1genes accesibles con texto alt adecuado, sem\u00e1ntica figure/figcaption y el patr\u00f3n de imagen decorativa
gallery.filter=Filtrar:
gallery.filter.all=Todos
gallery.filter.label=Filtros de categor\u00eda de galer\u00eda
gallery.badge.decorative=Decorativa
gallery.badge.alt=Texto alt
gallery.a11y.title=Accesibilidad: img() vs imgDecorative()
gallery.a11y.intro=JUX impone im\u00e1genes accesibles a nivel de API. No existe un m\u00e9todo img() sin texto alt - no existe. Debes usar una de dos opciones:
gallery.a11y.img.desc= - Para im\u00e1genes significativas. El texto alt describe la imagen para usuarios de lectores de pantalla. WCAG 1.1.1 lo requiere.
gallery.a11y.decorative.desc= - Para im\u00e1genes puramente decorativas que no a\u00f1aden informaci\u00f3n. Establece alt="" y role="presentation" para ocultar de la tecnolog\u00eda asistiva.
gallery.a11y.note=En esta galer\u00eda, las im\u00e1genes de Naturaleza, Arquitectura y Personas usan img() con texto alt descriptivo. Las im\u00e1genes Abstractas usan imgDecorative() ya que son texturas puramente visuales sin contenido informativo.

# \u2500\u2500 P\u00e1gina de Componentes \u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500
components.header.title=Muestra de Componentes
components.header.subtitle=Componentes accesibles integrados de jux-themes, m\u00e1s caracter\u00edsticas de la API de Element - todo renderizado en Java puro
components.breadcrumbs.title=Migas de Pan
components.breadcrumbs.desc=JuxBreadcrumb renderiza un rastro de navegaci\u00f3n accesible con aria-current en el \u00faltimo elemento.
components.tabs.title=Pesta\u00f1as
components.tabs.desc=JuxTabs renderiza un patr\u00f3n WAI-ARIA de pesta\u00f1as con role=tablist, role=tab y role=tabpanel.
components.tabs.overview=Vista General
components.tabs.overview.text=Los componentes JUX son clases Java que extienden Component y sobreescriben render(). Cada componente retorna un \u00e1rbol de Element que el framework serializa a HTML.
components.tabs.usage=Uso
components.tabs.accessibility=Accesibilidad
components.tabs.a11y.tablist=role="tablist" en el contenedor
components.tabs.a11y.tab=role="tab" con aria-selected en cada bot\u00f3n de pesta\u00f1a
components.tabs.a11y.panel=role="tabpanel" con aria-labelledby en cada panel
components.tabs.a11y.keys=Las teclas de flecha navegan entre pesta\u00f1as
components.accordion.title=Acorde\u00f3n
components.accordion.desc=JuxAccordion crea secciones expandibles/colapsables con aria-expanded y aria-controls.
components.accordion.q1=\u00bfQu\u00e9 es la API de Element?
components.accordion.a1=La API de Element es el DOM virtual de JUX. Construyes \u00e1rboles de elementos usando f\u00e1bricas est\u00e1ticas de la clase Elements: div(), h1(), section(), etc. Cada m\u00e9todo retorna un Element que puedes encadenar con .cls(), .attr(), .text(), .children().
components.accordion.q2=\u00bfC\u00f3mo funciona el SSR?
components.accordion.a2=JuxRenderer recorre el \u00e1rbol de Element y produce una cadena HTML5. Ensambla el documento completo: <html>, <head> con metadatos, <body> con contenido renderizado, recursos CSS/JS en las posiciones correctas.
components.accordion.q3=\u00bfQu\u00e9 pasa con el estado del lado del cliente?
components.accordion.a3=Los campos anotados con @State activan re-renderizados cuando su valor cambia. El StateManager toma una instant\u00e1nea antes y despu\u00e9s, compara los \u00e1rboles de Element y aplica solo las mutaciones cambiadas en el DOM.
components.form.title=Campos de Formulario
components.form.desc=JuxTextField crea campos de formulario accesibles con etiquetas, texto de ayuda y estados de validaci\u00f3n.
components.progress.title=Progreso
components.progress.desc=JuxProgress renderiza una barra de progreso accesible con role=progressbar y atributos ARIA de valor.
components.toasts.title=Notificaciones
components.toasts.desc=JuxToast renderiza notificaciones accesibles con role=alert y aria-live=assertive.
components.modal.title=Modal
components.modal.desc=JuxModal renderiza un di\u00e1logo accesible con role=dialog, aria-modal, trampa de foco y Escape para cerrar.
components.modal.open=Abrir Modal
components.modal.body.p1=Este es el contenido del cuerpo del modal. En una aplicaci\u00f3n real, podr\u00eda contener formularios, confirmaciones o informaci\u00f3n detallada.
components.modal.body.p2=El modal implementa trampa de foco, manejo de la tecla Escape y atributos ARIA adecuados para accesibilidad con lectores de pantalla.
components.dropdown.title=Men\u00fa Desplegable
components.dropdown.desc=JuxDropdown renderiza un bot\u00f3n de men\u00fa accesible con role=menu, navegaci\u00f3n con teclas de flecha y Escape para cerrar.
components.pagination.title=Paginaci\u00f3n
components.pagination.desc=JuxPagination renderiza navegaci\u00f3n de p\u00e1ginas accesible con aria-current, aria-disabled y punto de referencia nav adecuado.
components.pagination.page=P\u00e1gina {0} de {1}
components.pagination.first=Primera P\u00e1gina
components.pagination.last=\u00daltima P\u00e1gina
components.elements.title=API de Element
components.elements.desc=La clase Elements principal proporciona f\u00e1bricas para cada etiqueta HTML5 con accesibilidad integrada.
components.elements.semantic=Estructura Sem\u00e1ntica
components.elements.images=Im\u00e1genes (Texto Alt Requerido)
components.elements.images.note=La primera imagen tiene texto alt. La segunda usa imgDecorative() con alt="" y role="presentation".
components.elements.a11y=Ayudantes de Accesibilidad
components.elements.live=Regi\u00f3n en vivo: los cambios de contenido aqu\u00ed son anunciados por los lectores de pantalla
components.table.title=Tabla de Datos
components.table.desc=Tablas accesibles con caption, thead, atributos scope - impuestos por el motor de auditor\u00eda a11y.
components.table.caption=Dependencias de m\u00f3dulos del framework
components.table.col.module=M\u00f3dulo
components.table.col.package=Paquete
components.table.col.depends=Depende De
components.table.col.status=Estado
